src/cf/Catalogs/bon_ХарактеристикиБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>bon_ХарактеристикиБонусов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяЖизниБуфера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЖизниОстатков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБонуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ВидыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПереводаИзБуферавОстаток</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписанияОстаток</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЖизниОтрицательныхОстатков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключитьОНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключитьОСписании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСМСОНачислении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСМСОСписании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОСписанииЗа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтСуммыБонусовУведОНачисл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоСуммыБонусовУведОНачисл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратНаОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/bon_ХарактеристикиБонусов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидБонуса = Сертификат() Тогда
		Элементы.ДатаНачала.Доступность = Истина;
		Элементы.ДатаКонец.Доступность = Истина;
	Иначе 
		Элементы.ДатаНачала.Доступность = Ложь;
		Элементы.ДатаКонец.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Сертификат()
	Возврат Справочники.bon_ВидыНоминальныхОбъектов.НайтиПоКоду("57");	
КонецФункции

&НаКлиенте
Процедура ПоДатеПриИзменении(Элемент)
	
	Если Объект.ПоДате = Истина Тогда
		Элементы.ДатаПереводаИзБуферавОстаток.Доступность = Истина;
		Элементы.ДатаСписанияОстаток.Доступность = Истина;
		
		Элементы.ВремяЖизниБуфера.Доступность = Ложь;
		Элементы.ВремяЖизниОстатков.Доступность = Ложь;
		Объект.ВремяЖизниБуфера = Число(0);
		Объект.ВремяЖизниОстатков = Число(0);
	Иначе 
		Элементы.ДатаПереводаИзБуферавОстаток.Доступность = Ложь;
		Элементы.ДатаСписанияОстаток.Доступность = Ложь;
		Объект.ДатаПереводаИзБуферавОстаток = '00010101';
		Объект.ДатаСписанияОстаток = '00010101';

		Элементы.ВремяЖизниБуфера.Доступность = Истина;
		Элементы.ВремяЖизниОстатков.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОНачислениеПриИзменении(Элемент)
	
	Если Объект.ВключитьОНачисление = Истина Тогда
		Элементы.ТекстСМСОНачислении.ТолькоПросмотр = Ложь;
		Элементы.ОтСуммыБонусовУведОНачисл.ТолькоПросмотр = Ложь;
		Элементы.ДоСуммыБонусовУведОНачисл.ТолькоПросмотр = Ложь;
	Иначе 
		Элементы.ТекстСМСОНачислении.ТолькоПросмотр = Истина;
		Элементы.ОтСуммыБонусовУведОНачисл.ТолькоПросмотр = Истина;
		Элементы.ДоСуммыБонусовУведОНачисл.ТолькоПросмотр = Истина;
		
		Объект.ТекстСМСОНачислении 			= "";
		Объект.ОтСуммыБонусовУведОНачисл 	= Число(0);
		Объект.ДоСуммыБонусовУведОНачисл 	= Число(0);
	КонецЕсли;

КонецПроцедуры
